<a href="https://colab.research.google.com/github/swati-bakshani/pyspark/blob/main/pyspark_project.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
!apt-get install openjdk-8-jdk-headless -qq > /dev/null
!wget -q http://archive.apache.org/dist/spark/spark-3.1.1/spark-3.1.1-bin-hadoop3.2.tgz
!tar xf spark-3.1.1-bin-hadoop3.2.tgz
!pip install -q findspark
import os
os.environ["JAVA_HOME"] = "/usr/lib/jvm/java-8-openjdk-amd64"
os.environ["SPARK_HOME"] = "/content/spark-3.1.1-bin-hadoop3.2"
import findspark
findspark.init()
from pyspark.sql import SparkSession
spark = SparkSession.builder.master("local[*]").getOrCreate()
spark

In [3]:
mydata = spark.read.format("csv").option("header", "true").load("original.csv")
mydata.show()

+---+----------+----------+------+---------------+--------------------+---------+----------+-----------+
| id|first_name| last_name|gender|           City|            JobTitle|   Salary|  Latitude|  Longitude|
+---+----------+----------+------+---------------+--------------------+---------+----------+-----------+
|  1|   Melinde| Shilburne|Female|      Nowa Ruda| Assistant Professor|$57438.18|50.5774075| 16.4967184|
|  2|  Kimberly|Von Welden|Female|         Bulgan|       Programmer II|$62846.60|48.8231572|103.5218199|
|  3|    Alvera|  Di Boldi|Female|           null|                null|$57576.52|39.9947462|116.3397725|
|  4|   Shannon| O'Griffin|  Male|  Divnomorskoye|Budget/Accounting...|$61489.23|44.5047212| 38.1300171|
|  5|  Sherwood|   Macieja|  Male|      Mytishchi|            VP Sales|$63863.09|      null| 37.6489954|
|  6|     Maris|      Folk|Female|Kinsealy-Drinan|      Civil Engineer|$30101.16|53.4266145| -6.1644997|
|  7|     Masha|    Divers|Female|         Dachun|                null|$25090.87| 24.879416| 118.930111|
|  8|   Goddart|     Flear|  Male|      Trélissac|Desktop Support T...|$46116.36|45.1905186|  0.7423124|
|  9|      Roth|O'Cannavan|  Male|         Heitan|VP Product Manage...|$73697.10| 32.027934| 106.657113|
| 10|      Bran|   Trahear|  Male|       Arbeláez|Mechanical System...|$68098.42|  4.272793| -74.416014|
| 11|    Kylynn|   Lockart|Female|       El Cardo|Nuclear Power Eng...|$13604.63|     -5.85|-79.8833329|
| 12|       Rey|    Meharg|Female|    Wangqingtuo|Systems Administr...|$73423.70| 39.172378| 116.931607|
| 13|      Kerr|    Braden|  Male|      Sułkowice|Compensation Analyst|$33432.99|49.8151822| 19.3771749|
| 14|    Mickie| Whanstall|  Male|    Springfield|Assistant Media P...|$50838.53|42.1014803|-72.5766759|
| 15|    Kaspar|     Pally|  Male|         Chrást|  Analyst Programmer|$40163.03|49.7923299| 13.4915324|
| 16|    Norbie|    Gwyllt|  Male|         Xijiao|              Editor|$32492.73|43.4945737|  5.8978018|
| 17|    Claude|    Briant|Female|      Mieścisko|Research Assistan...|$51862.48|52.7441662| 17.3278637|
| 18|     Thain|    Habbon|  Male| Foros do Trapo|     Design Engineer|$42135.67| 38.696249| -8.7098337|
| 19|  Tiffanie|  Pattison|Female|    Jabungsisir|Senior Financial ...|$91925.08|-7.7232567|113.4686802|
| 20|    Ettore|  Gerriets|  Male|          Pedra| Staff Accountant IV|$73921.33|40.7172049| -8.3625148|
+---+----------+----------+------+---------------+--------------------+---------+----------+-----------+
only showing top 20 rows

# New Section

In [4]:
mydata.createOrReplaceTempView("employee")

In [5]:
spark.sql("select * from employee").show()

+---+----------+----------+------+---------------+--------------------+---------+----------+-----------+
| id|first_name| last_name|gender|           City|            JobTitle|   Salary|  Latitude|  Longitude|
+---+----------+----------+------+---------------+--------------------+---------+----------+-----------+
|  1|   Melinde| Shilburne|Female|      Nowa Ruda| Assistant Professor|$57438.18|50.5774075| 16.4967184|
|  2|  Kimberly|Von Welden|Female|         Bulgan|       Programmer II|$62846.60|48.8231572|103.5218199|
|  3|    Alvera|  Di Boldi|Female|           null|                null|$57576.52|39.9947462|116.3397725|
|  4|   Shannon| O'Griffin|  Male|  Divnomorskoye|Budget/Accounting...|$61489.23|44.5047212| 38.1300171|
|  5|  Sherwood|   Macieja|  Male|      Mytishchi|            VP Sales|$63863.09|      null| 37.6489954|
|  6|     Maris|      Folk|Female|Kinsealy-Drinan|      Civil Engineer|$30101.16|53.4266145| -6.1644997|
|  7|     Masha|    Divers|Female|         Dachun|                null|$25090.87| 24.879416| 118.930111|
|  8|   Goddart|     Flear|  Male|      Trélissac|Desktop Support T...|$46116.36|45.1905186|  0.7423124|
|  9|      Roth|O'Cannavan|  Male|         Heitan|VP Product Manage...|$73697.10| 32.027934| 106.657113|
| 10|      Bran|   Trahear|  Male|       Arbeláez|Mechanical System...|$68098.42|  4.272793| -74.416014|
| 11|    Kylynn|   Lockart|Female|       El Cardo|Nuclear Power Eng...|$13604.63|     -5.85|-79.8833329|
| 12|       Rey|    Meharg|Female|    Wangqingtuo|Systems Administr...|$73423.70| 39.172378| 116.931607|
| 13|      Kerr|    Braden|  Male|      Sułkowice|Compensation Analyst|$33432.99|49.8151822| 19.3771749|
| 14|    Mickie| Whanstall|  Male|    Springfield|Assistant Media P...|$50838.53|42.1014803|-72.5766759|
| 15|    Kaspar|     Pally|  Male|         Chrást|  Analyst Programmer|$40163.03|49.7923299| 13.4915324|
| 16|    Norbie|    Gwyllt|  Male|         Xijiao|              Editor|$32492.73|43.4945737|  5.8978018|
| 17|    Claude|    Briant|Female|      Mieścisko|Research Assistan...|$51862.48|52.7441662| 17.3278637|
| 18|     Thain|    Habbon|  Male| Foros do Trapo|     Design Engineer|$42135.67| 38.696249| -8.7098337|
| 19|  Tiffanie|  Pattison|Female|    Jabungsisir|Senior Financial ...|$91925.08|-7.7232567|113.4686802|
| 20|    Ettore|  Gerriets|  Male|          Pedra| Staff Accountant IV|$73921.33|40.7172049| -8.3625148|
+---+----------+----------+------+---------------+--------------------+---------+----------+-----------+
only showing top 20 rows

In [ ]:
dachun_data = spark.sql("select * from employee where city = 'Dachun'")
dachun_data.show()

+---+----------+---------+------+------+--------+---------+---------+----------+
| id|first_name|last_name|gender|  City|JobTitle|   Salary| Latitude| Longitude|
+---+----------+---------+------+------+--------+---------+---------+----------+
|  7|     Masha|   Divers|Female|Dachun|    null|$25090.87|24.879416|118.930111|
+---+----------+---------+------+------+--------+---------+---------+----------+

In [9]:
from pyspark.sql.functions import *
mydata2 = mydata.withColumn("clean_city", when(mydata.City.isNull(), 'Unknown').otherwise(mydata.City))

In [ ]:
mydata2.show()

+---+----------+----------+------+---------------+--------------------+---------+----------+-----------+---------------+
| id|first_name| last_name|gender|           City|            JobTitle|   Salary|  Latitude|  Longitude|     clean_city|
+---+----------+----------+------+---------------+--------------------+---------+----------+-----------+---------------+
|  1|   Melinde| Shilburne|Female|      Nowa Ruda| Assistant Professor|$57438.18|50.5774075| 16.4967184|      Nowa Ruda|
|  2|  Kimberly|Von Welden|Female|         Bulgan|       Programmer II|$62846.60|48.8231572|103.5218199|         Bulgan|
|  3|    Alvera|  Di Boldi|Female|           null|                null|$57576.52|39.9947462|116.3397725|        Unknown|
|  4|   Shannon| O'Griffin|  Male|  Divnomorskoye|Budget/Accounting...|$61489.23|44.5047212| 38.1300171|  Divnomorskoye|
|  5|  Sherwood|   Macieja|  Male|      Mytishchi|            VP Sales|$63863.09|      null| 37.6489954|      Mytishchi|
|  6|     Maris|      Folk|Female|Kinsealy-Drinan|      Civil Engineer|$30101.16|53.4266145| -6.1644997|Kinsealy-Drinan|
|  7|     Masha|    Divers|Female|         Dachun|                null|$25090.87| 24.879416| 118.930111|         Dachun|
|  8|   Goddart|     Flear|  Male|      Trélissac|Desktop Support T...|$46116.36|45.1905186|  0.7423124|      Trélissac|
|  9|      Roth|O'Cannavan|  Male|         Heitan|VP Product Manage...|$73697.10| 32.027934| 106.657113|         Heitan|
| 10|      Bran|   Trahear|  Male|       Arbeláez|Mechanical System...|$68098.42|  4.272793| -74.416014|       Arbeláez|
| 11|    Kylynn|   Lockart|Female|       El Cardo|Nuclear Power Eng...|$13604.63|     -5.85|-79.8833329|       El Cardo|
| 12|       Rey|    Meharg|Female|    Wangqingtuo|Systems Administr...|$73423.70| 39.172378| 116.931607|    Wangqingtuo|
| 13|      Kerr|    Braden|  Male|      Sułkowice|Compensation Analyst|$33432.99|49.8151822| 19.3771749|      Sułkowice|
| 14|    Mickie| Whanstall|  Male|    Springfield|Assistant Media P...|$50838.53|42.1014803|-72.5766759|    Springfield|
| 15|    Kaspar|     Pally|  Male|         Chrást|  Analyst Programmer|$40163.03|49.7923299| 13.4915324|         Chrást|
| 16|    Norbie|    Gwyllt|  Male|         Xijiao|              Editor|$32492.73|43.4945737|  5.8978018|         Xijiao|
| 17|    Claude|    Briant|Female|      Mieścisko|Research Assistan...|$51862.48|52.7441662| 17.3278637|      Mieścisko|
| 18|     Thain|    Habbon|  Male| Foros do Trapo|     Design Engineer|$42135.67| 38.696249| -8.7098337| Foros do Trapo|
| 19|  Tiffanie|  Pattison|Female|    Jabungsisir|Senior Financial ...|$91925.08|-7.7232567|113.4686802|    Jabungsisir|
| 20|    Ettore|  Gerriets|  Male|          Pedra| Staff Accountant IV|$73921.33|40.7172049| -8.3625148|          Pedra|
+---+----------+----------+------+---------------+--------------------+---------+----------+-----------+---------------+
only showing top 20 rows

In [ ]:
mydata.createOrReplaceTempView("employee")

In [ ]:
# mydata3 = spark.sql("""select *, (CASE WHEN City IS NULL THEN 'Unknown' ELSE City END) AS clean_city from employee""")

In [7]:
male_data = spark.sql("""
select * from employee where gender = 'Male'
""")

male_data.show()

+---+----------+-----------+------+--------------------+--------------------+---------+----------+-----------+
| id|first_name|  last_name|gender|                City|            JobTitle|   Salary|  Latitude|  Longitude|
+---+----------+-----------+------+--------------------+--------------------+---------+----------+-----------+
|  4|   Shannon|  O'Griffin|  Male|       Divnomorskoye|Budget/Accounting...|$61489.23|44.5047212| 38.1300171|
|  5|  Sherwood|    Macieja|  Male|           Mytishchi|            VP Sales|$63863.09|      null| 37.6489954|
|  8|   Goddart|      Flear|  Male|           Trélissac|Desktop Support T...|$46116.36|45.1905186|  0.7423124|
|  9|      Roth| O'Cannavan|  Male|              Heitan|VP Product Manage...|$73697.10| 32.027934| 106.657113|
| 10|      Bran|    Trahear|  Male|            Arbeláez|Mechanical System...|$68098.42|  4.272793| -74.416014|
| 13|      Kerr|     Braden|  Male|           Sułkowice|Compensation Analyst|$33432.99|49.8151822| 19.3771749|
| 14|    Mickie|  Whanstall|  Male|         Springfield|Assistant Media P...|$50838.53|42.1014803|-72.5766759|
| 15|    Kaspar|      Pally|  Male|              Chrást|  Analyst Programmer|$40163.03|49.7923299| 13.4915324|
| 16|    Norbie|     Gwyllt|  Male|              Xijiao|              Editor|$32492.73|43.4945737|  5.8978018|
| 18|     Thain|     Habbon|  Male|      Foros do Trapo|     Design Engineer|$42135.67| 38.696249| -8.7098337|
| 20|    Ettore|   Gerriets|  Male|               Pedra| Staff Accountant IV|$73921.33|40.7172049| -8.3625148|
| 21|      Alon|   Chasteau|  Male|               Xin’e|     Web Developer I|$62755.85|  49.16291|  127.98658|
| 22|   Guthrey|     Johnke|  Male|              Xijiao|         Developer I|$13708.03|40.7576842| 23.1342184|
| 27|    Jarvis|     Perone|  Male|           Hägersten| Associate Professor|$55313.18|59.2832062| 17.9570059|
| 32| Westleigh|Belderfield|  Male|         Xiang Ngeun|      Accountant III|$78336.59|19.7600399|102.1832854|
| 33|     Odell|    Morritt|  Male|Chalan Pago-Ordot...|     Design Engineer|$72777.48|13.4441374|144.7820914|
| 35|      Base|  Summerlad|  Male|         Changuinola|Business Systems ...|$53137.80| 9.4488704| -82.485187|
| 36|     Paddy|    Ashness|  Male|            Ddmashen|        Engineer III|$34851.65|40.5684068| 44.8157566|
| 37|     Nicko|      Frays|  Male|              Caxias|      Health Coach I|$99786.40|-4.8654138|-43.3619983|
| 43|   Hadrian|     Crumpe|  Male|               Rosso|Physical Therapy ...|$36879.44|16.5163413| -15.802612|
+---+----------+-----------+------+--------------------+--------------------+---------+----------+-----------+
only showing top 20 rows

In [10]:
mydata2 = mydata2.filter(mydata2.JobTitle.isNotNull())
mydata2.show()

+---+----------+----------+------+---------------+--------------------+---------+----------+-----------+---------------+
| id|first_name| last_name|gender|           City|            JobTitle|   Salary|  Latitude|  Longitude|     clean_city|
+---+----------+----------+------+---------------+--------------------+---------+----------+-----------+---------------+
|  1|   Melinde| Shilburne|Female|      Nowa Ruda| Assistant Professor|$57438.18|50.5774075| 16.4967184|      Nowa Ruda|
|  2|  Kimberly|Von Welden|Female|         Bulgan|       Programmer II|$62846.60|48.8231572|103.5218199|         Bulgan|
|  4|   Shannon| O'Griffin|  Male|  Divnomorskoye|Budget/Accounting...|$61489.23|44.5047212| 38.1300171|  Divnomorskoye|
|  5|  Sherwood|   Macieja|  Male|      Mytishchi|            VP Sales|$63863.09|      null| 37.6489954|      Mytishchi|
|  6|     Maris|      Folk|Female|Kinsealy-Drinan|      Civil Engineer|$30101.16|53.4266145| -6.1644997|Kinsealy-Drinan|
|  8|   Goddart|     Flear|  Male|      Trélissac|Desktop Support T...|$46116.36|45.1905186|  0.7423124|      Trélissac|
|  9|      Roth|O'Cannavan|  Male|         Heitan|VP Product Manage...|$73697.10| 32.027934| 106.657113|         Heitan|
| 10|      Bran|   Trahear|  Male|       Arbeláez|Mechanical System...|$68098.42|  4.272793| -74.416014|       Arbeláez|
| 11|    Kylynn|   Lockart|Female|       El Cardo|Nuclear Power Eng...|$13604.63|     -5.85|-79.8833329|       El Cardo|
| 12|       Rey|    Meharg|Female|    Wangqingtuo|Systems Administr...|$73423.70| 39.172378| 116.931607|    Wangqingtuo|
| 13|      Kerr|    Braden|  Male|      Sułkowice|Compensation Analyst|$33432.99|49.8151822| 19.3771749|      Sułkowice|
| 14|    Mickie| Whanstall|  Male|    Springfield|Assistant Media P...|$50838.53|42.1014803|-72.5766759|    Springfield|
| 15|    Kaspar|     Pally|  Male|         Chrást|  Analyst Programmer|$40163.03|49.7923299| 13.4915324|         Chrást|
| 16|    Norbie|    Gwyllt|  Male|         Xijiao|              Editor|$32492.73|43.4945737|  5.8978018|         Xijiao|
| 17|    Claude|    Briant|Female|      Mieścisko|Research Assistan...|$51862.48|52.7441662| 17.3278637|      Mieścisko|
| 18|     Thain|    Habbon|  Male| Foros do Trapo|     Design Engineer|$42135.67| 38.696249| -8.7098337| Foros do Trapo|
| 19|  Tiffanie|  Pattison|Female|    Jabungsisir|Senior Financial ...|$91925.08|-7.7232567|113.4686802|    Jabungsisir|
| 20|    Ettore|  Gerriets|  Male|          Pedra| Staff Accountant IV|$73921.33|40.7172049| -8.3625148|          Pedra|
| 21|      Alon|  Chasteau|  Male|          Xin’e|     Web Developer I|$62755.85|  49.16291|  127.98658|          Xin’e|
| 22|   Guthrey|    Johnke|  Male|         Xijiao|         Developer I|$13708.03|40.7576842| 23.1342184|         Xijiao|
+---+----------+----------+------+---------------+--------------------+---------+----------+-----------+---------------+
only showing top 20 rows

In [11]:
# quest 3 . remove dollar from the salary column

mydata2 = mydata2.withColumn('clean_salary', mydata2.Salary.substr(2,100).cast('float'))
# mydata2 = mydata2.withColumn('clean_salary', mydata2.Salary.substr(2,100))
mydata2.printSchema()
mydata2.show()

root
 |-- id: string (nullable = true)
 |-- first_name: string (nullable = true)
 |-- last_name: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- City: string (nullable = true)
 |-- JobTitle: string (nullable = true)
 |-- Salary: string (nullable = true)
 |-- Latitude: string (nullable = true)
 |-- Longitude: string (nullable = true)
 |-- clean_city: string (nullable = true)
 |-- clean_salary: float (nullable = true)

+---+----------+----------+------+---------------+--------------------+---------+----------+-----------+---------------+------------+
| id|first_name| last_name|gender|           City|            JobTitle|   Salary|  Latitude|  Longitude|     clean_city|clean_salary|
+---+----------+----------+------+---------------+--------------------+---------+----------+-----------+---------------+------------+
|  1|   Melinde| Shilburne|Female|      Nowa Ruda| Assistant Professor|$57438.18|50.5774075| 16.4967184|      Nowa Ruda|    57438.18|
|  2|  Kimberly|Von Welden|Female|         Bulgan|       Programmer II|$62846.60|48.8231572|103.5218199|         Bulgan|     62846.6|
|  4|   Shannon| O'Griffin|  Male|  Divnomorskoye|Budget/Accounting...|$61489.23|44.5047212| 38.1300171|  Divnomorskoye|    61489.23|
|  5|  Sherwood|   Macieja|  Male|      Mytishchi|            VP Sales|$63863.09|      null| 37.6489954|      Mytishchi|    63863.09|
|  6|     Maris|      Folk|Female|Kinsealy-Drinan|      Civil Engineer|$30101.16|53.4266145| -6.1644997|Kinsealy-Drinan|    30101.16|
|  8|   Goddart|     Flear|  Male|      Trélissac|Desktop Support T...|$46116.36|45.1905186|  0.7423124|      Trélissac|    46116.36|
|  9|      Roth|O'Cannavan|  Male|         Heitan|VP Product Manage...|$73697.10| 32.027934| 106.657113|         Heitan|     73697.1|
| 10|      Bran|   Trahear|  Male|       Arbeláez|Mechanical System...|$68098.42|  4.272793| -74.416014|       Arbeláez|    68098.42|
| 11|    Kylynn|   Lockart|Female|       El Cardo|Nuclear Power Eng...|$13604.63|     -5.85|-79.8833329|       El Cardo|    13604.63|
| 12|       Rey|    Meharg|Female|    Wangqingtuo|Systems Administr...|$73423.70| 39.172378| 116.931607|    Wangqingtuo|     73423.7|
| 13|      Kerr|    Braden|  Male|      Sułkowice|Compensation Analyst|$33432.99|49.8151822| 19.3771749|      Sułkowice|    33432.99|
| 14|    Mickie| Whanstall|  Male|    Springfield|Assistant Media P...|$50838.53|42.1014803|-72.5766759|    Springfield|    50838.53|
| 15|    Kaspar|     Pally|  Male|         Chrást|  Analyst Programmer|$40163.03|49.7923299| 13.4915324|         Chrást|    40163.03|
| 16|    Norbie|    Gwyllt|  Male|         Xijiao|              Editor|$32492.73|43.4945737|  5.8978018|         Xijiao|    32492.73|
| 17|    Claude|    Briant|Female|      Mieścisko|Research Assistan...|$51862.48|52.7441662| 17.3278637|      Mieścisko|    51862.48|
| 18|     Thain|    Habbon|  Male| Foros do Trapo|     Design Engineer|$42135.67| 38.696249| -8.7098337| Foros do Trapo|    42135.67|
| 19|  Tiffanie|  Pattison|Female|    Jabungsisir|Senior Financial ...|$91925.08|-7.7232567|113.4686802|    Jabungsisir|    91925.08|
| 20|    Ettore|  Gerriets|  Male|          Pedra| Staff Accountant IV|$73921.33|40.7172049| -8.3625148|          Pedra|    73921.33|
| 21|      Alon|  Chasteau|  Male|          Xin’e|     Web Developer I|$62755.85|  49.16291|  127.98658|          Xin’e|    62755.85|
| 22|   Guthrey|    Johnke|  Male|         Xijiao|         Developer I|$13708.03|40.7576842| 23.1342184|         Xijiao|    13708.03|
+---+----------+----------+------+---------------+--------------------+---------+----------+-----------+---------------+------------+
only showing top 20 rows

In [12]:
# remove dollar from the salary and add new column as clean_salary
clean_salary = spark.sql("""
select 
    *,
    SUBSTR(Salary,2 ,5) as clean_salary
from employee
""")
clean_salary.printSchema()
clean_salary.show()

root
 |-- id: string (nullable = true)
 |-- first_name: string (nullable = true)
 |-- last_name: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- City: string (nullable = true)
 |-- JobTitle: string (nullable = true)
 |-- Salary: string (nullable = true)
 |-- Latitude: string (nullable = true)
 |-- Longitude: string (nullable = true)
 |-- clean_salary: string (nullable = true)

+---+----------+----------+------+---------------+--------------------+---------+----------+-----------+------------+
| id|first_name| last_name|gender|           City|            JobTitle|   Salary|  Latitude|  Longitude|clean_salary|
+---+----------+----------+------+---------------+--------------------+---------+----------+-----------+------------+
|  1|   Melinde| Shilburne|Female|      Nowa Ruda| Assistant Professor|$57438.18|50.5774075| 16.4967184|       57438|
|  2|  Kimberly|Von Welden|Female|         Bulgan|       Programmer II|$62846.60|48.8231572|103.5218199|       62846|
|  3|    Alvera|  Di Boldi|Female|           null|                null|$57576.52|39.9947462|116.3397725|       57576|
|  4|   Shannon| O'Griffin|  Male|  Divnomorskoye|Budget/Accounting...|$61489.23|44.5047212| 38.1300171|       61489|
|  5|  Sherwood|   Macieja|  Male|      Mytishchi|            VP Sales|$63863.09|      null| 37.6489954|       63863|
|  6|     Maris|      Folk|Female|Kinsealy-Drinan|      Civil Engineer|$30101.16|53.4266145| -6.1644997|       30101|
|  7|     Masha|    Divers|Female|         Dachun|                null|$25090.87| 24.879416| 118.930111|       25090|
|  8|   Goddart|     Flear|  Male|      Trélissac|Desktop Support T...|$46116.36|45.1905186|  0.7423124|       46116|
|  9|      Roth|O'Cannavan|  Male|         Heitan|VP Product Manage...|$73697.10| 32.027934| 106.657113|       73697|
| 10|      Bran|   Trahear|  Male|       Arbeláez|Mechanical System...|$68098.42|  4.272793| -74.416014|       68098|
| 11|    Kylynn|   Lockart|Female|       El Cardo|Nuclear Power Eng...|$13604.63|     -5.85|-79.8833329|       13604|
| 12|       Rey|    Meharg|Female|    Wangqingtuo|Systems Administr...|$73423.70| 39.172378| 116.931607|       73423|
| 13|      Kerr|    Braden|  Male|      Sułkowice|Compensation Analyst|$33432.99|49.8151822| 19.3771749|       33432|
| 14|    Mickie| Whanstall|  Male|    Springfield|Assistant Media P...|$50838.53|42.1014803|-72.5766759|       50838|
| 15|    Kaspar|     Pally|  Male|         Chrást|  Analyst Programmer|$40163.03|49.7923299| 13.4915324|       40163|
| 16|    Norbie|    Gwyllt|  Male|         Xijiao|              Editor|$32492.73|43.4945737|  5.8978018|       32492|
| 17|    Claude|    Briant|Female|      Mieścisko|Research Assistan...|$51862.48|52.7441662| 17.3278637|       51862|
| 18|     Thain|    Habbon|  Male| Foros do Trapo|     Design Engineer|$42135.67| 38.696249| -8.7098337|       42135|
| 19|  Tiffanie|  Pattison|Female|    Jabungsisir|Senior Financial ...|$91925.08|-7.7232567|113.4686802|       91925|
| 20|    Ettore|  Gerriets|  Male|          Pedra| Staff Accountant IV|$73921.33|40.7172049| -8.3625148|       73921|
+---+----------+----------+------+---------------+--------------------+---------+----------+-----------+------------+
only showing top 20 rows

In [28]:
clean_salary_cast = spark.sql("""
select 
  *,
  CAST(SUBSTR(Salary,2 ,5) as float) as clean_salary
from employee
""")
clean_salary_cast.createOrReplaceTempView("employee_clean")
clean_salary_cast.printSchema()
clean_salary_cast.show()

root
 |-- id: string (nullable = true)
 |-- first_name: string (nullable = true)
 |-- last_name: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- City: string (nullable = true)
 |-- JobTitle: string (nullable = true)
 |-- Salary: string (nullable = true)
 |-- Latitude: string (nullable = true)
 |-- Longitude: string (nullable = true)
 |-- clean_salary: float (nullable = true)

+---+----------+----------+------+---------------+--------------------+---------+----------+-----------+------------+
| id|first_name| last_name|gender|           City|            JobTitle|   Salary|  Latitude|  Longitude|clean_salary|
+---+----------+----------+------+---------------+--------------------+---------+----------+-----------+------------+
|  1|   Melinde| Shilburne|Female|      Nowa Ruda| Assistant Professor|$57438.18|50.5774075| 16.4967184|     57438.0|
|  2|  Kimberly|Von Welden|Female|         Bulgan|       Programmer II|$62846.60|48.8231572|103.5218199|     62846.0|
|  3|    Alvera|  Di Boldi|Female|           null|                null|$57576.52|39.9947462|116.3397725|     57576.0|
|  4|   Shannon| O'Griffin|  Male|  Divnomorskoye|Budget/Accounting...|$61489.23|44.5047212| 38.1300171|     61489.0|
|  5|  Sherwood|   Macieja|  Male|      Mytishchi|            VP Sales|$63863.09|      null| 37.6489954|     63863.0|
|  6|     Maris|      Folk|Female|Kinsealy-Drinan|      Civil Engineer|$30101.16|53.4266145| -6.1644997|     30101.0|
|  7|     Masha|    Divers|Female|         Dachun|                null|$25090.87| 24.879416| 118.930111|     25090.0|
|  8|   Goddart|     Flear|  Male|      Trélissac|Desktop Support T...|$46116.36|45.1905186|  0.7423124|     46116.0|
|  9|      Roth|O'Cannavan|  Male|         Heitan|VP Product Manage...|$73697.10| 32.027934| 106.657113|     73697.0|
| 10|      Bran|   Trahear|  Male|       Arbeláez|Mechanical System...|$68098.42|  4.272793| -74.416014|     68098.0|
| 11|    Kylynn|   Lockart|Female|       El Cardo|Nuclear Power Eng...|$13604.63|     -5.85|-79.8833329|     13604.0|
| 12|       Rey|    Meharg|Female|    Wangqingtuo|Systems Administr...|$73423.70| 39.172378| 116.931607|     73423.0|
| 13|      Kerr|    Braden|  Male|      Sułkowice|Compensation Analyst|$33432.99|49.8151822| 19.3771749|     33432.0|
| 14|    Mickie| Whanstall|  Male|    Springfield|Assistant Media P...|$50838.53|42.1014803|-72.5766759|     50838.0|
| 15|    Kaspar|     Pally|  Male|         Chrást|  Analyst Programmer|$40163.03|49.7923299| 13.4915324|     40163.0|
| 16|    Norbie|    Gwyllt|  Male|         Xijiao|              Editor|$32492.73|43.4945737|  5.8978018|     32492.0|
| 17|    Claude|    Briant|Female|      Mieścisko|Research Assistan...|$51862.48|52.7441662| 17.3278637|     51862.0|
| 18|     Thain|    Habbon|  Male| Foros do Trapo|     Design Engineer|$42135.67| 38.696249| -8.7098337|     42135.0|
| 19|  Tiffanie|  Pattison|Female|    Jabungsisir|Senior Financial ...|$91925.08|-7.7232567|113.4686802|     91925.0|
| 20|    Ettore|  Gerriets|  Male|          Pedra| Staff Accountant IV|$73921.33|40.7172049| -8.3625148|     73921.0|
+---+----------+----------+------+---------------+--------------------+---------+----------+-----------+------------+
only showing top 20 rows

In [13]:
# Get average salary
mean = mydata2.groupby().avg('clean_salary')
mean.printSchema()
print(type(mean))
mean.show()
print(mean)

root
 |-- avg(clean_salary): double (nullable = true)

<class 'pyspark.sql.dataframe.DataFrame'>
+-----------------+
|avg(clean_salary)|
+-----------------+
|55516.32088199837|
+-----------------+

DataFrame[avg(clean_salary): double]

In [ ]:
mean = mydata2.groupby().avg('clean_salary').take(1)[0][0]
# mean.printSchema()
# mean.show()
print(type(mean))
print(mean)

<class 'float'>
55516.32088199837

In [ ]:
# to do
# calculate average salary using clean salary
mean = spark.sql("""
SELECT 
  CAST(AVG(clean_salary) as float) as average_salary
from employee_clean
""")
mean.printSchema()
mean.show()

root
 |-- average_salary: float (nullable = true)

+--------------+
|average_salary|
+--------------+
|     55487.457|
+--------------+

In [ ]:
# latitute

In [15]:
import numpy as np 
latitudes = mydata2.select('Latitude')
latitudes.show()

+----------+
|  Latitude|
+----------+
|50.5774075|
|48.8231572|
|44.5047212|
|      null|
|53.4266145|
|45.1905186|
| 32.027934|
|  4.272793|
|     -5.85|
| 39.172378|
|49.8151822|
|42.1014803|
|49.7923299|
|43.4945737|
|52.7441662|
| 38.696249|
|-7.7232567|
|40.7172049|
|  49.16291|
|40.7576842|
+----------+
only showing top 20 rows

In [16]:
latitudes = latitudes.filter(latitudes.Latitude.isNotNull())
latitudes.show()

+----------+
|  Latitude|
+----------+
|50.5774075|
|48.8231572|
|44.5047212|
|53.4266145|
|45.1905186|
| 32.027934|
|  4.272793|
|     -5.85|
| 39.172378|
|49.8151822|
|42.1014803|
|49.7923299|
|43.4945737|
|52.7441662|
| 38.696249|
|-7.7232567|
|40.7172049|
|  49.16291|
|40.7576842|
|48.4902808|
+----------+
only showing top 20 rows

In [17]:
latitudes = latitudes.withColumn('latitude2', latitudes.Latitude.cast('float'))
latitudes = latitudes.select('latitude2') 
latitudes.show()

+----------+
| latitude2|
+----------+
| 50.577408|
|  48.82316|
| 44.504723|
| 53.426613|
| 45.190517|
| 32.027935|
|  4.272793|
|     -5.85|
|  39.17238|
|  49.81518|
|  42.10148|
|  49.79233|
| 43.494576|
| 52.744167|
| 38.696247|
|-7.7232566|
| 40.717205|
|  49.16291|
| 40.757683|
|  48.49028|
+----------+
only showing top 20 rows

In [18]:
median = np.median(latitudes.collect())

In [ ]:
print(median)

31.93397331237793

In [21]:
mydata2 = mydata2.withColumn('lat', when(mydata2.Latitude.isNull(), lit(median)).otherwise(mydata2.Latitude))
mydata2.show()

+---+----------+----------+------+---------------+--------------------+---------+----------+-----------+---------------+------------+-----------------+
| id|first_name| last_name|gender|           City|            JobTitle|   Salary|  Latitude|  Longitude|     clean_city|clean_salary|              lat|
+---+----------+----------+------+---------------+--------------------+---------+----------+-----------+---------------+------------+-----------------+
|  1|   Melinde| Shilburne|Female|      Nowa Ruda| Assistant Professor|$57438.18|50.5774075| 16.4967184|      Nowa Ruda|    57438.18|       50.5774075|
|  2|  Kimberly|Von Welden|Female|         Bulgan|       Programmer II|$62846.60|48.8231572|103.5218199|         Bulgan|     62846.6|       48.8231572|
|  4|   Shannon| O'Griffin|  Male|  Divnomorskoye|Budget/Accounting...|$61489.23|44.5047212| 38.1300171|  Divnomorskoye|    61489.23|       44.5047212|
|  5|  Sherwood|   Macieja|  Male|      Mytishchi|            VP Sales|$63863.09|      null| 37.6489954|      Mytishchi|    63863.09|31.93397331237793|
|  6|     Maris|      Folk|Female|Kinsealy-Drinan|      Civil Engineer|$30101.16|53.4266145| -6.1644997|Kinsealy-Drinan|    30101.16|       53.4266145|
|  8|   Goddart|     Flear|  Male|      Trélissac|Desktop Support T...|$46116.36|45.1905186|  0.7423124|      Trélissac|    46116.36|       45.1905186|
|  9|      Roth|O'Cannavan|  Male|         Heitan|VP Product Manage...|$73697.10| 32.027934| 106.657113|         Heitan|     73697.1|        32.027934|
| 10|      Bran|   Trahear|  Male|       Arbeláez|Mechanical System...|$68098.42|  4.272793| -74.416014|       Arbeláez|    68098.42|         4.272793|
| 11|    Kylynn|   Lockart|Female|       El Cardo|Nuclear Power Eng...|$13604.63|     -5.85|-79.8833329|       El Cardo|    13604.63|            -5.85|
| 12|       Rey|    Meharg|Female|    Wangqingtuo|Systems Administr...|$73423.70| 39.172378| 116.931607|    Wangqingtuo|     73423.7|        39.172378|
| 13|      Kerr|    Braden|  Male|      Sułkowice|Compensation Analyst|$33432.99|49.8151822| 19.3771749|      Sułkowice|    33432.99|       49.8151822|
| 14|    Mickie| Whanstall|  Male|    Springfield|Assistant Media P...|$50838.53|42.1014803|-72.5766759|    Springfield|    50838.53|       42.1014803|
| 15|    Kaspar|     Pally|  Male|         Chrást|  Analyst Programmer|$40163.03|49.7923299| 13.4915324|         Chrást|    40163.03|       49.7923299|
| 16|    Norbie|    Gwyllt|  Male|         Xijiao|              Editor|$32492.73|43.4945737|  5.8978018|         Xijiao|    32492.73|       43.4945737|
| 17|    Claude|    Briant|Female|      Mieścisko|Research Assistan...|$51862.48|52.7441662| 17.3278637|      Mieścisko|    51862.48|       52.7441662|
| 18|     Thain|    Habbon|  Male| Foros do Trapo|     Design Engineer|$42135.67| 38.696249| -8.7098337| Foros do Trapo|    42135.67|        38.696249|
| 19|  Tiffanie|  Pattison|Female|    Jabungsisir|Senior Financial ...|$91925.08|-7.7232567|113.4686802|    Jabungsisir|    91925.08|       -7.7232567|
| 20|    Ettore|  Gerriets|  Male|          Pedra| Staff Accountant IV|$73921.33|40.7172049| -8.3625148|          Pedra|    73921.33|       40.7172049|
| 21|      Alon|  Chasteau|  Male|          Xin’e|     Web Developer I|$62755.85|  49.16291|  127.98658|          Xin’e|    62755.85|         49.16291|
| 22|   Guthrey|    Johnke|  Male|         Xijiao|         Developer I|$13708.03|40.7576842| 23.1342184|         Xijiao|    13708.03|       40.7576842|
+---+----------+----------+------+---------------+--------------------+---------+----------+-----------+---------------+------------+-----------------+
only showing top 20 rows

In [23]:
# avg salary for male and female

import pyspark.sql.functions as sqlfunc
genders = mydata2.groupBy('gender').agg(sqlfunc.avg('clean_salary').alias('avg_salary'))
genders.show()

+------+------------------+
|gender|        avg_salary|
+------+------------------+
|Female|55677.250125558036|
|  Male| 55361.09385573019|
+------+------------------+

In [33]:
genders = spark.sql("""
SELECT gender, avg(clean_salary) as avg_salary 
FROM employee_clean
group by gender
""")
genders.show()

+------+-----------------+
|gender|       avg_salary|
+------+-----------------+
|Female|55618.46341463415|
|  Male|55360.57677165354|
+------+-----------------+

In [27]:
df = mydata2.withColumn('Female_Salary', when(mydata2.gender == 'Female', mydata2.clean_salary).otherwise(lit(0)))
df = df.withColumn('Male_salary', when(df.gender == 'Male', df.clean_salary).otherwise(lit(0)))
df.show()

+---+----------+----------+------+---------------+--------------------+---------+----------+-----------+---------------+------------+-----------------+-------------+-----------+
| id|first_name| last_name|gender|           City|            JobTitle|   Salary|  Latitude|  Longitude|     clean_city|clean_salary|              lat|Female_Salary|Male_salary|
+---+----------+----------+------+---------------+--------------------+---------+----------+-----------+---------------+------------+-----------------+-------------+-----------+
|  1|   Melinde| Shilburne|Female|      Nowa Ruda| Assistant Professor|$57438.18|50.5774075| 16.4967184|      Nowa Ruda|    57438.18|       50.5774075|     57438.18|        0.0|
|  2|  Kimberly|Von Welden|Female|         Bulgan|       Programmer II|$62846.60|48.8231572|103.5218199|         Bulgan|     62846.6|       48.8231572|      62846.6|        0.0|
|  4|   Shannon| O'Griffin|  Male|  Divnomorskoye|Budget/Accounting...|$61489.23|44.5047212| 38.1300171|  Divnomorskoye|    61489.23|       44.5047212|          0.0|   61489.23|
|  5|  Sherwood|   Macieja|  Male|      Mytishchi|            VP Sales|$63863.09|      null| 37.6489954|      Mytishchi|    63863.09|31.93397331237793|          0.0|   63863.09|
|  6|     Maris|      Folk|Female|Kinsealy-Drinan|      Civil Engineer|$30101.16|53.4266145| -6.1644997|Kinsealy-Drinan|    30101.16|       53.4266145|     30101.16|        0.0|
|  8|   Goddart|     Flear|  Male|      Trélissac|Desktop Support T...|$46116.36|45.1905186|  0.7423124|      Trélissac|    46116.36|       45.1905186|          0.0|   46116.36|
|  9|      Roth|O'Cannavan|  Male|         Heitan|VP Product Manage...|$73697.10| 32.027934| 106.657113|         Heitan|     73697.1|        32.027934|          0.0|    73697.1|
| 10|      Bran|   Trahear|  Male|       Arbeláez|Mechanical System...|$68098.42|  4.272793| -74.416014|       Arbeláez|    68098.42|         4.272793|          0.0|   68098.42|
| 11|    Kylynn|   Lockart|Female|       El Cardo|Nuclear Power Eng...|$13604.63|     -5.85|-79.8833329|       El Cardo|    13604.63|            -5.85|     13604.63|        0.0|
| 12|       Rey|    Meharg|Female|    Wangqingtuo|Systems Administr...|$73423.70| 39.172378| 116.931607|    Wangqingtuo|     73423.7|        39.172378|      73423.7|        0.0|
| 13|      Kerr|    Braden|  Male|      Sułkowice|Compensation Analyst|$33432.99|49.8151822| 19.3771749|      Sułkowice|    33432.99|       49.8151822|          0.0|   33432.99|
| 14|    Mickie| Whanstall|  Male|    Springfield|Assistant Media P...|$50838.53|42.1014803|-72.5766759|    Springfield|    50838.53|       42.1014803|          0.0|   50838.53|
| 15|    Kaspar|     Pally|  Male|         Chrást|  Analyst Programmer|$40163.03|49.7923299| 13.4915324|         Chrást|    40163.03|       49.7923299|          0.0|   40163.03|
| 16|    Norbie|    Gwyllt|  Male|         Xijiao|              Editor|$32492.73|43.4945737|  5.8978018|         Xijiao|    32492.73|       43.4945737|          0.0|   32492.73|
| 17|    Claude|    Briant|Female|      Mieścisko|Research Assistan...|$51862.48|52.7441662| 17.3278637|      Mieścisko|    51862.48|       52.7441662|     51862.48|        0.0|
| 18|     Thain|    Habbon|  Male| Foros do Trapo|     Design Engineer|$42135.67| 38.696249| -8.7098337| Foros do Trapo|    42135.67|        38.696249|          0.0|   42135.67|
| 19|  Tiffanie|  Pattison|Female|    Jabungsisir|Senior Financial ...|$91925.08|-7.7232567|113.4686802|    Jabungsisir|    91925.08|       -7.7232567|     91925.08|        0.0|
| 20|    Ettore|  Gerriets|  Male|          Pedra| Staff Accountant IV|$73921.33|40.7172049| -8.3625148|          Pedra|    73921.33|       40.7172049|          0.0|   73921.33|
| 21|      Alon|  Chasteau|  Male|          Xin’e|     Web Developer I|$62755.85|  49.16291|  127.98658|          Xin’e|    62755.85|         49.16291|          0.0|   62755.85|
| 22|   Guthrey|    Johnke|  Male|         Xijiao|         Developer I|$13708.03|40.7576842| 23.1342184|         Xijiao|    13708.03|       40.7576842|          0.0|   13708.03|
+---+----------+----------+------+---------------+--------------------+---------+----------+-----------+---------------+------------+-----------------+-------------+-----------+
only showing top 20 rows

In [45]:
gender_salary = spark.sql("""
SELECT *,
CASE WHEN gender = 'Female' THEN clean_salary ELSE 0.0 END AS female_salary,
CASE WHEN gender = 'Male' THEN clean_salary ELSE 0.0 END AS male_salary
FROM employee_clean
""")
gender_salary.createOrReplaceTempView("gender_salary")
gender_salary.show()

+---+----------+----------+------+---------------+--------------------+---------+----------+-----------+------------+-------------+-----------+
| id|first_name| last_name|gender|           City|            JobTitle|   Salary|  Latitude|  Longitude|clean_salary|female_salary|male_salary|
+---+----------+----------+------+---------------+--------------------+---------+----------+-----------+------------+-------------+-----------+
|  1|   Melinde| Shilburne|Female|      Nowa Ruda| Assistant Professor|$57438.18|50.5774075| 16.4967184|     57438.0|      57438.0|        0.0|
|  2|  Kimberly|Von Welden|Female|         Bulgan|       Programmer II|$62846.60|48.8231572|103.5218199|     62846.0|      62846.0|        0.0|
|  3|    Alvera|  Di Boldi|Female|           null|                null|$57576.52|39.9947462|116.3397725|     57576.0|      57576.0|        0.0|
|  4|   Shannon| O'Griffin|  Male|  Divnomorskoye|Budget/Accounting...|$61489.23|44.5047212| 38.1300171|     61489.0|          0.0|    61489.0|
|  5|  Sherwood|   Macieja|  Male|      Mytishchi|            VP Sales|$63863.09|      null| 37.6489954|     63863.0|          0.0|    63863.0|
|  6|     Maris|      Folk|Female|Kinsealy-Drinan|      Civil Engineer|$30101.16|53.4266145| -6.1644997|     30101.0|      30101.0|        0.0|
|  7|     Masha|    Divers|Female|         Dachun|                null|$25090.87| 24.879416| 118.930111|     25090.0|      25090.0|        0.0|
|  8|   Goddart|     Flear|  Male|      Trélissac|Desktop Support T...|$46116.36|45.1905186|  0.7423124|     46116.0|          0.0|    46116.0|
|  9|      Roth|O'Cannavan|  Male|         Heitan|VP Product Manage...|$73697.10| 32.027934| 106.657113|     73697.0|          0.0|    73697.0|
| 10|      Bran|   Trahear|  Male|       Arbeláez|Mechanical System...|$68098.42|  4.272793| -74.416014|     68098.0|          0.0|    68098.0|
| 11|    Kylynn|   Lockart|Female|       El Cardo|Nuclear Power Eng...|$13604.63|     -5.85|-79.8833329|     13604.0|      13604.0|        0.0|
| 12|       Rey|    Meharg|Female|    Wangqingtuo|Systems Administr...|$73423.70| 39.172378| 116.931607|     73423.0|      73423.0|        0.0|
| 13|      Kerr|    Braden|  Male|      Sułkowice|Compensation Analyst|$33432.99|49.8151822| 19.3771749|     33432.0|          0.0|    33432.0|
| 14|    Mickie| Whanstall|  Male|    Springfield|Assistant Media P...|$50838.53|42.1014803|-72.5766759|     50838.0|          0.0|    50838.0|
| 15|    Kaspar|     Pally|  Male|         Chrást|  Analyst Programmer|$40163.03|49.7923299| 13.4915324|     40163.0|          0.0|    40163.0|
| 16|    Norbie|    Gwyllt|  Male|         Xijiao|              Editor|$32492.73|43.4945737|  5.8978018|     32492.0|          0.0|    32492.0|
| 17|    Claude|    Briant|Female|      Mieścisko|Research Assistan...|$51862.48|52.7441662| 17.3278637|     51862.0|      51862.0|        0.0|
| 18|     Thain|    Habbon|  Male| Foros do Trapo|     Design Engineer|$42135.67| 38.696249| -8.7098337|     42135.0|          0.0|    42135.0|
| 19|  Tiffanie|  Pattison|Female|    Jabungsisir|Senior Financial ...|$91925.08|-7.7232567|113.4686802|     91925.0|      91925.0|        0.0|
| 20|    Ettore|  Gerriets|  Male|          Pedra| Staff Accountant IV|$73921.33|40.7172049| -8.3625148|     73921.0|          0.0|    73921.0|
+---+----------+----------+------+---------------+--------------------+---------+----------+-----------+------------+-------------+-----------+
only showing top 20 rows

In [52]:
dept_wise_gender_salary = gender_salary.groupBy('JobTitle').agg(sqlfunc.avg('female_salary').alias('final_female_salary'), sqlfunc.avg('male_salary').alias('final_male_salary'))
dept_wise_gender_salary.createOrReplaceTempView("deptwise_gender_salary")
dept_wise_gender_salary.show()

+--------------------+-------------------+------------------+
|            JobTitle|final_female_salary| final_male_salary|
+--------------------+-------------------+------------------+
|Systems Administr...|           50590.25|          15540.75|
|   Media Manager III| 29586.333333333332|17381.666666666668|
|  Recruiting Manager| 34848.166666666664|26383.333333333332|
|       Geologist III|            31749.0|12830.333333333334|
|        Geologist II|                0.0|           43293.5|
|Database Administ...|                0.0|           52018.0|
|   Financial Analyst|            23353.6|           39605.8|
|  Analyst Programmer|            16405.9|           21042.8|
|Software Engineer II|                0.0|           74782.0|
|       Accountant IV|            82732.0|               0.0|
|    Product Engineer|            41825.1|           20464.8|
|Software Test Eng...| 32218.333333333332|27122.166666666668|
|Safety Technician...|                0.0|           29421.0|
|    Junior Executive| 15752.166666666666|49509.833333333336|
|Systems Administr...|            77059.0|               0.0|
|Human Resources A...|           24022.25|           16609.0|
|        VP Marketing|  7981.166666666667|52844.166666666664|
|  Environmental Tech| 13706.666666666666|           45660.5|
|Mechanical System...| 31370.666666666668|          44321.25|
| Assistant Professor|            22175.8|           26912.5|
+--------------------+-------------------+------------------+
only showing top 20 rows

In [48]:
dept_wise_gender_salary = spark.sql("""
SELECT JobTitle, avg(female_salary) as final_female_salary, avg(male_salary) as final_male_salary
FROM gender_salary
GROUP BY JobTitle
""")
dept_wise_gender_salary.show()

+--------------------+-------------------+------------------+
|            JobTitle|final_female_salary| final_male_salary|
+--------------------+-------------------+------------------+
|Systems Administr...|           50590.25|          15540.75|
|   Media Manager III| 29586.333333333332|17381.666666666668|
|  Recruiting Manager| 34848.166666666664|26383.333333333332|
|       Geologist III|            31749.0|12830.333333333334|
|        Geologist II|                0.0|           43293.5|
|Database Administ...|                0.0|           52018.0|
|   Financial Analyst|            23353.6|           39605.8|
|  Analyst Programmer|            16405.9|           21042.8|
|Software Engineer II|                0.0|           74782.0|
|       Accountant IV|            82732.0|               0.0|
|    Product Engineer|            41825.1|           20464.8|
|Software Test Eng...| 32218.333333333332|27122.166666666668|
|Safety Technician...|                0.0|           29421.0|
|    Junior Executive| 15752.166666666666|49509.833333333336|
|Systems Administr...|            77059.0|               0.0|
|Human Resources A...|           24022.25|           16609.0|
|        VP Marketing|  7981.166666666667|52844.166666666664|
|  Environmental Tech| 13706.666666666666|           45660.5|
|Mechanical System...| 31370.666666666668|          44321.25|
| Assistant Professor|            22175.8|           26912.5|
+--------------------+-------------------+------------------+
only showing top 20 rows

In [50]:
# diff in male and female salry dept wise

salary_diff = dept_wise_gender_salary.withColumn('salary_diff', dept_wise_gender_salary.final_female_salary - dept_wise_gender_salary.final_male_salary)
salary_diff.show()

+--------------------+-------------------+------------------+-------------------+
|            JobTitle|final_female_salary| final_male_salary|        salary_diff|
+--------------------+-------------------+------------------+-------------------+
|Systems Administr...|           50590.25|          15540.75|            35049.5|
|   Media Manager III| 29586.333333333332|17381.666666666668| 12204.666666666664|
|  Recruiting Manager| 34848.166666666664|26383.333333333332|  8464.833333333332|
|       Geologist III|            31749.0|12830.333333333334| 18918.666666666664|
|        Geologist II|                0.0|           43293.5|           -43293.5|
|Database Administ...|                0.0|           52018.0|           -52018.0|
|   Financial Analyst|            23353.6|           39605.8|-16252.200000000004|
|  Analyst Programmer|            16405.9|           21042.8| -4636.899999999998|
|Software Engineer II|                0.0|           74782.0|           -74782.0|
|       Accountant IV|            82732.0|               0.0|            82732.0|
|    Product Engineer|            41825.1|           20464.8|            21360.3|
|Software Test Eng...| 32218.333333333332|27122.166666666668|  5096.166666666664|
|Safety Technician...|                0.0|           29421.0|           -29421.0|
|    Junior Executive| 15752.166666666666|49509.833333333336| -33757.66666666667|
|Systems Administr...|            77059.0|               0.0|            77059.0|
|Human Resources A...|           24022.25|           16609.0|            7413.25|
|        VP Marketing|  7981.166666666667|52844.166666666664|           -44863.0|
|  Environmental Tech| 13706.666666666666|           45660.5|-31953.833333333336|
|Mechanical System...| 31370.666666666668|          44321.25|-12950.583333333332|
| Assistant Professor|            22175.8|           26912.5| -4736.700000000001|
+--------------------+-------------------+------------------+-------------------+
only showing top 20 rows

In [53]:
salary_diff = spark.sql("""
SELECT JobTitle, final_female_salary, final_male_salary, (final_female_salary - final_male_salary) as salary_diff
FROM deptwise_gender_salary
""")

salary_diff.show()

+--------------------+-------------------+------------------+-------------------+
|            JobTitle|final_female_salary| final_male_salary|        salary_diff|
+--------------------+-------------------+------------------+-------------------+
|Systems Administr...|           50590.25|          15540.75|            35049.5|
|   Media Manager III| 29586.333333333332|17381.666666666668| 12204.666666666664|
|  Recruiting Manager| 34848.166666666664|26383.333333333332|  8464.833333333332|
|       Geologist III|            31749.0|12830.333333333334| 18918.666666666664|
|        Geologist II|                0.0|           43293.5|           -43293.5|
|Database Administ...|                0.0|           52018.0|           -52018.0|
|   Financial Analyst|            23353.6|           39605.8|-16252.200000000004|
|  Analyst Programmer|            16405.9|           21042.8| -4636.899999999998|
|Software Engineer II|                0.0|           74782.0|           -74782.0|
|       Accountant IV|            82732.0|               0.0|            82732.0|
|    Product Engineer|            41825.1|           20464.8|            21360.3|
|Software Test Eng...| 32218.333333333332|27122.166666666668|  5096.166666666664|
|Safety Technician...|                0.0|           29421.0|           -29421.0|
|    Junior Executive| 15752.166666666666|49509.833333333336| -33757.66666666667|
|Systems Administr...|            77059.0|               0.0|            77059.0|
|Human Resources A...|           24022.25|           16609.0|            7413.25|
|        VP Marketing|  7981.166666666667|52844.166666666664|           -44863.0|
|  Environmental Tech| 13706.666666666666|           45660.5|-31953.833333333336|
|Mechanical System...| 31370.666666666668|          44321.25|-12950.583333333332|
| Assistant Professor|            22175.8|           26912.5| -4736.700000000001|
+--------------------+-------------------+------------------+-------------------+
only showing top 20 rows

In [56]:
city_wise_avg_salary = gender_salary.groupBy('City').agg(sqlfunc.avg('clean_salary').alias('avg_salary'))
city_wise_avg_salary = city_wise_avg_salary.sort(col('avg_salary').desc())
city_wise_avg_salary.printSchema()
city_wise_avg_salary.show()

root
 |-- City: string (nullable = true)
 |-- avg_salary: double (nullable = true)

+-----------------+----------+
|             City|avg_salary|
+-----------------+----------+
|        Mesopotam|   99948.0|
|       Zhongcheng|   99942.0|
|           Caxias|   99786.0|
|      Karangtawar|   99638.0|
|        Itabaiana|   99502.0|
|           Pasian|   99421.0|
|           Webuye|   99368.0|
|      Yuktae-dong|   99250.0|
|           Zinder|   99222.0|
|   Timiryazevskiy|   99142.0|
|        Sawahbaru|   99013.0|
|          Madimba|   98737.0|
|         Huangshi|   98690.0|
|          Gharyan|   98679.0|
|         Yŏnan-ŭp|   98628.0|
|     Wringinputih|   98603.0|
|Monte da Boavista|   98586.0|
|          Klukeng|   98439.0|
|         Murmashi|   98226.0|
|        Fox Creek|   98138.0|
+-----------------+----------+
only showing top 20 rows

In [57]:
city_wise_avg_salary = spark.sql("""
SELECT City, AVG(clean_salary) as avg_salary
FROM gender_salary
GROUP BY City
ORDER BY avg_salary desc
""")

city_wise_avg_salary.show()

+-----------------+----------+
|             City|avg_salary|
+-----------------+----------+
|        Mesopotam|   99948.0|
|       Zhongcheng|   99942.0|
|           Caxias|   99786.0|
|      Karangtawar|   99638.0|
|        Itabaiana|   99502.0|
|           Pasian|   99421.0|
|           Webuye|   99368.0|
|      Yuktae-dong|   99250.0|
|           Zinder|   99222.0|
|   Timiryazevskiy|   99142.0|
|        Sawahbaru|   99013.0|
|          Madimba|   98737.0|
|         Huangshi|   98690.0|
|          Gharyan|   98679.0|
|         Yŏnan-ŭp|   98628.0|
|     Wringinputih|   98603.0|
|Monte da Boavista|   98586.0|
|          Klukeng|   98439.0|
|         Murmashi|   98226.0|
|        Fox Creek|   98138.0|
+-----------------+----------+
only showing top 20 rows